In [1]:
import numpy as np
import pandas as pd

In [10]:
vals2 = np.array([1, np.nan, 3, 4])

In [12]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [14]:
# NaN 처리
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2) vals2.nanmean()

(8.0, 1.0, 4.0)

In [63]:
df = pd.DataFrame({'col1' : [1, np.nan, 2, None]})
df['col2'] = [None, 2, 3, np.nan]
df['col3'] = [1, np.nan, 3, np.nan]
df

   col1  col2  col3
0   1.0   NaN   1.0
1   NaN   2.0   NaN
2   2.0   3.0   3.0
3   NaN   NaN   NaN

In [64]:
df.col1.isnull() ## Series
df.notnull() ## 전체 DataFrame

    col1   col2   col3
0   True  False   True
1  False   True  False
2   True   True   True
3  False  False  False

In [55]:
df

   col1  col2  col3
0   1.0   1.0   1.0
1   NaN   2.0   NaN
2   2.0   3.0   3.0
3   NaN   NaN   NaN

In [78]:
df

   col1  col2  col3
0   1.0   NaN   1.0
1   NaN   2.0   NaN
2   2.0   3.0   3.0
3   NaN   NaN   NaN

In [80]:
df.fillna(method='bfill')

   col1  col2  col3
0   1.0   2.0   1.0
1   2.0   2.0   3.0
2   2.0   3.0   3.0
3   NaN   NaN   NaN

In [51]:
df.col1 = df.col1.fillna(2)

In [62]:
df

   col1  col2  col3
0   1.0   1.0   1.0
1   NaN   2.0   NaN
2   2.0   3.0   3.0
3   NaN   NaN   NaN

In [81]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [87]:
titanic.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False

In [104]:
titanic.groupby(['sex', 'class'])[['survived']].aggregate('mean').reset_index()

      sex   class  survived
0  female   First  0.968085
1  female  Second  0.921053
2  female   Third  0.500000
3    male   First  0.368852
4    male  Second  0.157407
5    male   Third  0.135447

In [107]:
titanic.pivot_table('survived', index='sex', columns='class')

class   First  Second  Third
sex
female     94      76    144
male      122     108    347

In [114]:
local_sample = ['서울','부산','대구','경기']
month_sample = [str(i)+'월' for i in np.arange(1,13)]

In [155]:
np.random.seed(1)
local = np.random.choice(local_sample,1000)
month = np.random.choice(month_sample,1000)
val1 = np.random.randint(50,1000,1000)
val2 = np.random.randint(20,100,1000)

In [156]:
dt = pd.DataFrame(local)
dt['month'] = month
dt['income'] = val1
dt['outcome'] = val2
dt.columns = ['local','month','income','outcome']

In [157]:
dt

    local month  income  outcome
0      부산    9월     389       21
1      경기    7월      50       60
2      서울    5월     783       57
3      서울   10월     903       78
4      경기    1월     485       27
..    ...   ...     ...      ...
995    서울    3월     343       31
996    서울   12월     518       66
997    대구   12월     724       57
998    대구    4월     177       60
999    대구    4월     620       26

[1000 rows x 4 columns]

In [161]:
dt.pivot_table(['income','outcome'],index='month',columns='local',aggfunc={'income':
                                                                          'min','outcome':'max'})

      income                outcome
local     경기   대구   부산   서울      경기  대구  부산  서울
month
10월      113   79   59  163      99  94  99  90
11월       95   59   84   60      98  99  89  91
12월       58  155   95   72      93  95  99  95
1월        76  102   85   83      97  99  88  98
2월       110  121   63  165      88  91  92  98
3월       111   53  142   50      87  98  98  97
4월       154   79   51   98      96  89  96  99
5월        88   75  162   79      92  96  99  98
6월        86  117   74  196      94  96  97  93
7월        50   74  114   75      98  98  95  95
8월        88   98  178  201      95  98  98  97
9월        52   64   77   71      98  98  96  99

In [133]:
titanic.age.fillna(titanic.age.mean(),inplace=True)

In [145]:
age = pd.cut(titanic.age,[0, 18, 50, 80])

In [140]:
np.linspace(titanic.age.min(),titanic.age.max(),4)

array([ 0.42      , 26.94666667, 53.47333333, 80.        ])

In [146]:
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 50]  0.971429  0.915254  0.490000
       (50, 80]  1.000000  0.666667  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 50]  0.395604  0.086420  0.125436
       (50, 80]  0.192308  0.083333  0.000000

In [165]:
dt = pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv')

In [167]:
str_dt = dt.Name

In [194]:
str_dt[2][:15]

'Heikkinen, Miss'

In [196]:
str_dt.str.extract('([A-Za-z]+)', expand=False)

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [201]:
str_dt.str.contains('Braund')

0       True
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [205]:
str_dt.str.find(' ')

0       7
1       8
2      10
3       9
4       6
       ..
886     9
887     7
888     9
889     5
890     7
Name: Name, Length: 891, dtype: int64

In [219]:
str_dt[str_dt.str.len()==str_dt.str.len().max()].str.split().str.join('**')

307    Penasco**y**Castellana,**Mrs.**Victor**de**Sat...
Name: Name, dtype: object

In [ ]:
full_monte = pd.DataFrame({'name': monte,
                           'info': ['B|C|D', 'B|D', 'A|C',
                                    'B|D', 'B|C', 'B|C|D']})
full_monte

In [229]:
monte = str_dt[:6]
full_monte = pd.DataFrame(monte)
full_monte['information'] = ['B|C|D','B|D','A|C','B|D','B|C','B|C|D']

In [231]:
full_monte.information.str.get_dummies('|')

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  0  1
4  0  1  1  0
5  0  1  1  1

In [236]:
x = str_dt.str.get_dummies(' ')

In [248]:
x.sum()==x.sum().max()

"Andy"      False
"Annie      False
"Annie"     False
"Archie"    False
"Bessie"    False
            ...
hoef,       False
of          False
the         False
van         False
y           False
Length: 1673, dtype: bool

In [255]:
from datetime import datetime
x = datetime(year=2019, month=10, day=1, hour=10,minute=30)

In [259]:
x = np.array('2021-05-24',dtype=np.datetime64)

In [266]:
a = x + np.arange(365)

In [275]:
np.datetime64(a[300],'W')

numpy.datetime64('2022-03-17')

In [278]:
a[100]-a[0]

numpy.timedelta64(100,'D')

In [280]:
a = np.datetime64('2021-05-01 02:04:00')
b = np.datetime64('2021-05-24 11:04:15')

In [284]:
date = pd.to_datetime("24 may, 2021")
date

Timestamp('2021-05-24 00:00:00')

In [285]:
date.strftime('%A')

'Monday'

In [286]:
from datetime import datetime

In [291]:
pd.to_datetime(datetime.now())+pd.to_timedelta(np.arange(12), 'h')

DatetimeIndex(['2021-05-24 12:25:28.499017', '2021-05-24 13:25:28.499017',
               '2021-05-24 14:25:28.499017', '2021-05-24 15:25:28.499017',
               '2021-05-24 16:25:28.499017', '2021-05-24 17:25:28.499017',
               '2021-05-24 18:25:28.499017', '2021-05-24 19:25:28.499017',
               '2021-05-24 20:25:28.499017', '2021-05-24 21:25:28.499017',
               '2021-05-24 22:25:28.499017', '2021-05-24 23:25:28.499017'],
              dtype='datetime64[ns]', freq=None)

In [294]:
range_time = pd.to_datetime('2018-01-01') + pd.to_timedelta(np.arange(3*365),'D')

In [305]:
product = pd.DataFrame(range_time)
product['local'] = np.random.choice(['A','B','C'],range_time.size)
product['sales'] = np.random.randint(200,300,range_time.size)
product.columns = ['date','local','sales']

In [318]:
product['weekday'] = [ i.strftime('%A') for i in product.date]

In [334]:
product.set_index('date')['2018-10-01':'2018-10-03']

           local  sales    weekday
date
2018-10-01     A    242     Monday
2018-10-02     B    228    Tuesday
2018-10-03     C    200  Wednesday

In [327]:
import plotly.express as px
fig = px.bar(product, x='weekday', y='sales')

In [328]:
import dash
import dash_core_components as dcc
import dash_html_components as html

In [329]:
app = dash.Dash(__name__)
app.layout = html.Div(
    [ dcc.Graph(
        figure = fig
    )]
)

In [330]:
app.run_server(port='7777')

Dash is running on http://127.0.0.1:7777/

Dash is running on http://127.0.0.1:7777/

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://127.0.0.1:7777/ (Press CTRL+C to quit)
127.0.0.1 - - [24/May/2021 12:47:01] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [24/May/2021 12:47:01] "GET /_dash-dependencies HTTP/1.1" 200 -
127.0.0.1 - - [24/May/2021 12:47:01] "GET /_dash-layout HTTP/1.1" 200 -